data/pressure_sweep/cases/8e-6/icofoam_8e-6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "405";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(0.00014508 3.82538e-08 -8.76974e-27)
(0.00014345 5.09365e-08 -6.25203e-26)
(0.000142728 6.05822e-08 7.99348e-26)
(0.000142616 6.54475e-08 3.74522e-26)
(0.000142964 6.57759e-08 5.60315e-25)
(0.000143675 6.07483e-08 -1.33797e-24)
(0.000144704 4.91286e-08 1.25784e-24)
(0.000146045 2.84989e-08 -1.8321e-24)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    Walls
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
