data/pressure_sweep/cases/8e-6/icofoam_8e-6/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "405";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
-5.84631e-13
-3.46115e-07
-6.46313e-07
-9.07636e-07
-1.13722e-06
-1.33999e-06
-1.51991e-06
-1.68001e-06
...
)
;

boundaryField
{
    inlet
    {
        type            uniformJump;
        patchType       cyclic;
        jumpTable       table ((0 -8e-6) (25 -8e-6) (25.5 -1e-4) (26 -8e-6));
        value           nonuniform List<scalar> 
40
(
1.84513e-07
1.87663e-07
1.91701e-07
1.96165e-07
2.01222e-07
2.07161e-07
2.14384e-07
2.23543e-07
...
)
;
    }
    outlet
    {
        type            uniformJump;
        patchType       cyclic;
        value           nonuniform List<scalar> 
40
(
-7.81549e-06
-7.81234e-06
-7.8083e-06
-7.80383e-06
-7.79878e-06
-7.79284e-06
-7.78562e-06
-7.77646e-06
...
)
;
    }
    Walls
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
