data/pressure_sweep/cases/8e-6/icofoam_8e-6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

HAR 1;

vertices
(
    (0 2 0)         // 0
    (1 2 0)         // 1
    (4 2 0)         // 2
    (5 2 0)         // 3
    (0 0 0)         // 4
    (1 0 0)         // 5
    (4 0 0)         // 6
    (5 0 0)         // 7
    (1 -1.68 0)     // 8
    (4 -1.68 0)     // 9

    (0 2 $HAR)      // 10
    (1 2 $HAR)      // 11
    (4 2 $HAR)      // 12
    (5 2 $HAR)      // 13
    (0 0 $HAR)      // 14
    (1 0 $HAR)      // 15
    (4 0 $HAR)      // 16
    (5 0 $HAR)      // 17
    (1 -1.68 $HAR)  // 18
    (4 -1.68 $HAR)  // 19

);

blocks
(
    hex (4 5 1 0 14 15 11 10) (15 40 1) edgeGrading (.1 1 1 .1
                                                      ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1))
                                                      1 1 1 1 )     // 1

    hex (5 6 2 1 15 16 12 11) (45 40 1) edgeGrading (((.5 .5 10)(.5 .5 .1)) 1 1 ((.5 .5 10)(.5 .5 .1))
                                                      ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1))
                                                       1 1 1 1)     // 2

    hex (6 7 3 2 16 17 13 12) (15 40 1) edgeGrading (10 1 1 10
                                                      ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1))
                                                        1 1 1 1)     // 3

    hex (8 9 6 5 18 19 16 15) (45 40 1) edgeGrading (1 ((.5 .5 10)(.5 .5 .1)) ((.5 .5 10)(.5 .5 .1)) 1
                                                       .1 .1 .1 .1
                                                        1 1 1 1)     // 4
   

);

edges
(
);

boundary
(
    inlet
    {
        type              cyclic;
        neighbourPatch    outlet;
        faces
        (
            (4 14 10 0)
        );
        matchTolerance 1e-9;
    }
    outlet
    {
        type              cyclic;
        neighbourPatch    inlet;
        faces
        (
            (7 3 13 17)
        );
        matchTolerance 1e-9;
    }
    Walls
    {
        type wall;
        faces
        (
            (10 11 1 0)
            (11 12 2 1)
            (12 13 3 2)
            (14 15 5 4)
            (16 17 7 6)
            (18 19 9 8)
            (8 5 15 18)
            (9 6 16 19)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 1 0)
            (5 6 2 1)
            (6 7 3 2)
            (8 9 6 5)
        );
    }
    front
    {
        type empty;
        faces
        (
            (14 15 11 10)
            (15 16 12 11)
            (16 17 13 12)
            (18 19 16 15)
        );
    }
);


// ************************************************************************* //
