data/pressure_sweep/cases/8e-6/icofoam_8e-6/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
